export const BOT_MESSAGES = {
  USER_GREETING: ", привіт! ${BOT_NAME} на зв'язку! Не метишуй 😉",
  HELP_INFO:
    'Телеграм Бот ${BOT_NAME} який обслуговує ТГ канал @${CHANNEL_NAME}',
  POST_SENT: 'Файна новина на тему ${TOPIC} успішно відправлена в канал!',
  POST_SENT_ALL:
    "${BOT_NAME} звітує: газету оновлено! Якщо будете брати у туалет, не забудьте добре пом'яти",
  ADMIN_SUCCESS: 'Дякую! У доступі дозволено! Пішов працювати над постами 🫠',
  ERROR: {
    GENERAL: 'Чуєш, там щось заглючило, подивися пліз!',
    SHARE_PHONE: 'Щось не так, попробуй ще раз з команди /search_and_publish',
    ADMIN_PHONE_NUMBER: 'Хех! Так ти ж не Адмін, не можна так!',
  },
  BUTTON: {
    SHARE_PHONE_NUMBER: 'Поділитися номером',
    SHARE_PHONE_PARAGRAPH:
      'Давай перевіримо, чи маєш ти доступ? ${BOT_NAME} все контролює 🤨',
  },
};
